### Connecting Sqlite files

In [2]:
import sqlite3
db=sqlite3.connect("C:\Python\SQLite\IMDB.sqlite")
db

In [3]:
db=sqlite3.connect("IMDB_1.sqlite")
db

In [11]:
db=sqlite3.connect("School.sqlite")
db

### Creating Cursor

In [12]:
cur=db.cursor()
cur

In [13]:
sql_query='Create table Student (RollNumber int Primary key ,Name text , Age int)'
cur.execute(sql_query)

In [16]:
cur.execute('insert into Student values(45,"Rohan",19)')

In [17]:
db.commit()

### Passing Parameters

In [1]:
import sqlite3
db=sqlite3.connect("School.sqlite")
cur=db.cursor()

In [3]:
cur.execute("insert into Student values(102,'Mohit',24)")
db.commit()

In [4]:
rollno=103
name="Aman"
age=20
cur.execute("insert into Student values(?,?,?)",(rollno,name,age))
db.commit()

In [5]:
# Execute Many rows

values=[(110,"roshan",19),(111,"soumesh",19),(112,"rudra",20)]
cur.executemany("insert into Student values(?,?,?)",values)
db.commit()

### Fetching Values

In [7]:
cur.execute("Select * from Student")
cur.fetchone()

(45, 'Rohan', 19)

In [10]:
cur.execute("Select * from Student")
cur.fetchmany(10)

[(45, 'Rohan', 19),
 (102, 'Mohit', 24),
 (103, 'Aman', 20),
 (110, 'roshan', 19),
 (111, 'soumesh', 19),
 (112, 'rudra', 20)]

In [11]:
cur.execute("Select * from Student")
cur.fetchall()

[(45, 'Rohan', 19),
 (102, 'Mohit', 24),
 (103, 'Aman', 20),
 (110, 'roshan', 19),
 (111, 'soumesh', 19),
 (112, 'rudra', 20)]

### Using Pandas

In [13]:
import pandas as pd
df=pd.read_sql_query("Select * from Student",db)
df

   RollNumber     Name  Age
0          45    Rohan   19
1         102    Mohit   24
2         103     Aman   20
3         110   roshan   19
4         111  soumesh   19
5         112    rudra   20